In [2]:
import numpy as np
import pandas as pd

In [3]:
car_data = pd.read_csv('model_car_data.csv')

In [4]:
car_data.head()

   Unnamed: 0       car_name  model   Mileage  Year     Condition     Price
0           0          lexus     LX   21204.0  2018  Foreign Used  50015000
1           1         toyota  Camry  140309.0  2013  Foreign Used   5015000
2           2         toyota  Venza  172709.0  2013  Foreign Used   7115000
3           3  mercedes-benz      C  114936.0  2010  Foreign Used   4815000
4           4         toyota  Lexus  123938.5  2012  Foreign Used   8515000

In [5]:
car_data.drop('Unnamed: 0', axis=1, inplace = True)

In [23]:
car_data.head()

        car_name  model   Mileage  Year     Condition     Price
0          lexus     LX   21204.0  2018  Foreign Used  50015000
1         toyota  Camry  140309.0  2013  Foreign Used   5015000
2         toyota  Venza  172709.0  2013  Foreign Used   7115000
3  mercedes-benz      C  114936.0  2010  Foreign Used   4815000
4         toyota  Lexus  123938.5  2012  Foreign Used   8515000

In [24]:
car_data['car_name'].value_counts()

toyota           4414
lexus            1926
mercedes-benz    1143
honda             449
hyundai           294
nissan            243
kia               242
ford              218
acura             201
audi              147
pontiac           137
volkswagen        113
land               83
peugeot            82
mazda              68
bmw                65
mitsubishi         63
infiniti           47
chevrolet          35
volvo              24
jeep               23
dodge              23
mercedes           18
suzuki             16
chrysler           13
Name: car_name, dtype: int64

In [25]:
car_data.shape

(10087, 6)

In [26]:
car_data[car_data['Price']<0]

Empty DataFrame
Columns: [car_name, model, Mileage, Year, Condition, Price]
Index: []

>>Handling Categorical Feature By using get_dummies function

In [49]:
from sklearn.preprocessing import LabelEncoder
df2 = car_data.copy()
# encode the categorical data
le_Name = LabelEncoder()
le_Model = LabelEncoder()
le_Condition = LabelEncoder()
df2['car_name'] = le_Name.fit_transform(df2['car_name'].astype(str))
df2['model'] = le_Model.fit_transform(df2['model'].astype(str))
df2['Condition'] = le_Condition.fit_transform(df2['Condition'].astype(str))

In [51]:
df2.tail()

       car_name  model   Mileage  Year  Condition    Price
10082        22     80  161088.0  2006          2  1735000
10083        18     35   67887.0  2013          2  2310000
10084        22    215   48502.0  2010          2  9210000
10085        16    315   80497.0  2005          2  3001250
10086        17    255  124776.0  2012          2  3957500

In [27]:
car_data1 = car_data.drop(['car_name', 'model'], axis=1)

In [29]:
car_data1.head()

    Mileage  Year     Condition     Price
0   21204.0  2018  Foreign Used  50015000
1  140309.0  2013  Foreign Used   5015000
2  172709.0  2013  Foreign Used   7115000
3  114936.0  2010  Foreign Used   4815000
4  123938.5  2012  Foreign Used   8515000

In [7]:
car_data2 = car_data[['car_name', 'model']]|

SyntaxError: invalid syntax (Temp/ipykernel_1684/3354650660.py, line 1)

In [6]:
car_data2.head(20)

NameError: name 'car_data2' is not defined

In [46]:
df = pd.get_dummies(car_data1, drop_first=True)
df.head(50)

     Mileage  Year     Price  Condition_New  Condition_Nigerian Used
0    21204.0  2018  50015000              0                        0
1   140309.0  2013   5015000              0                        0
2   172709.0  2013   7115000              0                        0
3   114936.0  2010   4815000              0                        0
4   123938.5  2012   8515000              0                        0
5    96091.0  2013   7615000              0                        0
6    75422.0  2009   3515000              0                        0
7   221505.0  2009   4215000              0                        0
8   176996.0  2012   4865000              0                        0
9    74479.0  2013   8815000              0                        0
10  116368.2  2010   4865000              0                        0
11  134462.0  2008   2815000              0                        0
12   20820.0  2016  15015000              0                        0
13   69601.0  2012  25015000              0                        1
14   82310.0  2010   3515000              0                        0
15  250414.9  2005   5815000              0                        0
16   31504.0  2017  42515000              0                        1
17  370921.0  2007   4415000              0                        0
18  194550.0  2008   4645000              0                        0
19   68326.0  2011   5515000              0                        0
20  201050.0  2008   5685000              0                        0
21  118888.0  2007   5115000              0                        0
22  137471.0  2010   7765000              0                        0
23  857506.0  2010   5315000              0                        0
24   72443.0  2011  50015000              0                        0
25   68453.0  2013   5015000              0                        0
26   57451.0  2004   7115000              0                        0
27  165901.0  2012   4815000              0                        0
28   68208.0  2012   8515000              0                        0
29  203162.0  2010   7615000              0                        0
30  109763.4  2013   3515000              0                        0
31  243717.0  2012   4215000              0                        0
32   83554.0  2013   4865000              0                        0
33   63380.0  2016   8815000              0                        0
34  146372.0  2013   4865000              0                        0
35   98219.0  2013   2815000              0                        0
36   48415.0  2016  15015000              0                        0
37   91406.0  2014  25015000              0                        0
38   48013.0  2015   3515000              0                        0
39   72283.0  2012   5815000              0                        0
40   35751.0  2011  30015000              0                        0
41   52310.0  2011  14515000              0                        0
42  193892.0  2006   2515000              0                        0
43  282613.0  2006   2797500              0                        0
44   71584.0  2015   6515000              0                        0
45  112019.0  2012   5680000              0                        0
46   98697.0  2015   8770000              0                        0
47  106800.0  2013   9285000              0                        0
48   72443.0  2018   6215000              0                        0
49   68453.0  2013   9315000              0                        0